#include "lcd1602.h"
//encode: utf-8
//普中资料里面的，懒得再写，就改了个编码

/*******************************************************************************
* 函数名       : lcd1602_write_cmd
* 函数功能		 : LCD1602写命令
* 输入         : cmd：命令
* 输出       	 : 无
*******************************************************************************/
#if (LCD1602_4OR8_DATA_INTERFACE==0)//8位LCD
void lcd1602_write_cmd(u8 cmd)
{
	LCD1602_RS=0;//选择命令
	LCD1602_RW=0;//选择写
	LCD1602_E=0;
	LCD1602_DATAPORT=cmd;//准备命令
	delay_ms(1);
	LCD1602_E=1;//使能端E高电平写入
	delay_ms(1);
	LCD1602_E=0;//使能端E低电平完成写入	
}
#else	//4位LCD
void lcd1602_write_cmd(u8 cmd)
{
	LCD1602_RS=0;//选择命令
	LCD1602_RW=0;//选择写
	LCD1602_E=0;
	LCD1602_DATAPORT=cmd;//准备命令
	delay_ms(1);
	LCD1602_E=1;//使能端E高电平写入
	delay_ms(1);
	LCD1602_E=0;//使能端E低电平完成写入
	
	LCD1602_DATAPORT=cmd<<4;//准备命令
	delay_ms(1);
	LCD1602_E=1;//使能端E高电平写入
	delay_ms(1);
	LCD1602_E=0;//使能端E低电平完成写入	
}
#endif

/*******************************************************************************
* 函数名       : lcd1602_write_data
* 函数功能		 : LCD1602写数据
* 输入         : dat：数据
* 输出       	 : 无
*******************************************************************************/
#if (LCD1602_4OR8_DATA_INTERFACE==0)//8位LCD
void lcd1602_write_data(u8 dat) 
{
	LCD1602_RS=1;//选择数据
	LCD1602_RW=0;//选择写
	LCD1602_E=0;
	LCD1602_DATAPORT=dat;//准备数据
	delay_ms(1);
	LCD1602_E=1;//使能端E高电平写入
	delay_ms(1);
	LCD1602_E=0;//使能端E低电平完成写入		
}
#else
void lcd1602_write_data(u8 dat) 
{
	LCD1602_RS=1;//选择数据
	LCD1602_RW=0;//选择写
	LCD1602_E=0;
	LCD1602_DATAPORT=dat;//准备数据
	delay_ms(1);
	LCD1602_E=1;//使能端E高电平写入
	delay_ms(1);
	LCD1602_E=0;//使能端E低电平完成写入
	
	LCD1602_DATAPORT=dat<<4;//准备数据
	delay_ms(1);
	LCD1602_E=1;//使能端E高电平写入
	delay_ms(1);
	LCD1602_E=0;//使能端E低电平完成写入		
}
#endif

/*******************************************************************************
* 函数名       : lcd1602_init
* 函数功能		 : LCD1602初始化
* 输入         : 无
* 输出       	 : 无
*******************************************************************************/
#if (LCD1602_4OR8_DATA_INTERFACE==0)//8位LCD
void lcd1602_init(void)
{
	lcd1602_write_cmd(0x38);//设置显示8位数据，显示2行，5*7点阵/字符
	lcd1602_write_cmd(0x0c);//显示开，光标关，光标不闪烁
	lcd1602_write_cmd(0x06);//写数据后光标右移，显示不移动
	lcd1602_write_cmd(0x01);//清屏	
}
#else
void lcd1602_init(void)
{
	lcd1602_write_cmd(0x28);//设置显示4位数据，显示2行，5*7点阵/字符
	lcd1602_write_cmd(0x0c);//显示开，光标关，光标不闪烁
	lcd1602_write_cmd(0x06);//写数据后光标右移，显示不移动
	lcd1602_write_cmd(0x01);//清屏	
}
#endif

/*******************************************************************************
* 函数名       : lcd1602_clear
* 函数功能		 : LCD1602清屏
* 输入         : 无
* 输出       	 : 无
*******************************************************************************/
void lcd1602_clear(void)
{
	lcd1602_write_cmd(0x01);	
}

/*******************************************************************************
* 函数名       : lcd1602_show_string
* 函数功能		 : LCD1602显示字符串
* 输入         : x,y：显示位置，x=0~15，y=0~1;
				   str：显示字符串
* 输出       	 : 无
*******************************************************************************/
void lcd1602_show_string(u8 x,u8 y,u8 *str)
{
	u8 i=0;

	if(y>1||x>15)return;//超出范围强制退出

	if(y<1)	//第1行显示
	{	
		while(*str!='\0')//字符串以'\0'为结束，只要前面有数据就显示
		{
			if(i<16-x)//如果字符串长度在第一行显示范围内，在第一行显示
			{
				lcd1602_write_cmd(0x80+i+x);//第一行显示地址设置	
			}
			else
			{
				lcd1602_write_cmd(0x40+0x80+i+x-16);//第二行显示地址设置	
			}
			lcd1602_write_data(*str);//显示数据
			str++;//指针后移
			i++;	
		}	
	}
	else	//第2行显示
	{
		while(*str!='\0')
		{
			if(i<16-x) //如果字符串长度在第二行显示范围内，在第二行显示
			{
				lcd1602_write_cmd(0x80+0x40+i+x);	
			}
			else
			{
				lcd1602_write_cmd(0x80+i+x-16);	
			}
			lcd1602_write_data(*str);
			str++;
			i++;	
		}	
	}				
}